{
    "ControllerClass": "OpenChat_VLM_HL_Controller",
    "ControllerConfig": {
      "opening_query_text": "You are controlling a robot dog to get through obstacles in this scene. The robot dog is the size of a golden retriever. The goal is to make forward progress in this starting direction and arrive at the location of a red chew toy on the other side of the obstacles in front of you. After each action you command the robot to take, you will be given a new image taken from the head of the robot dog. Each time you receive an image, you must command one of the following six actions: Walk, Crawl, Left, Right, Backward, Climb. You should command Crawl when it should go under an obstacle, command Climb when it should go over the obstacle. Examples of obstacles the robot can safely Climb over include stairs, small suitcases, cushions, small logs, and small boxes. Do not try to Crawl under these. Examples of obstacles the robot can safely Crawl under include furniture (if there is sufficient space) and suspended tree branches. Do not try to Climb furniture and suspended tree branches. Command Left when it should go left to get around an obstacle, and Right when it should go right to get around the obstacle. Right/Left command inplace turns, meaning that the robot will change the direction it is facing but not its position. This means that if you command a turn, you need to move forwards in order to move in the new direction. Do not try to turn Left or Right when you confidently believe you are underneath or above an obstacle. You should command the robot Backward if the camera is obscured and it is not clear what other action to take. If there is space to walk forward in front of you, you should command Walk. If you ever command Backward, do not try to do the same action you did before you commanded Backward again immediately (you may do so later once you are in a different scenario). If it is possible to go under the obstacle, try to Crawl, and if it is possible to go over an obstacle, try to Climb, but only if it seems like a clear path after the obstacle. If not, it might be a dead end and it might be better to move Backward. Keep in mind that the camera is on the head of the robot, and the whole body of the robot is 3 feet behind and also needs to clear the obstacle. Even if the camera view is clear, the body of the robot might be stuck: in these cases, consider Backward or repeating the same action as before. The task can be completed with the right sequence of actions, so if the robot is not succeeding, you should use the history of actions and experiences to figure out why and command different actions. When you chose Walk, Crawl, or Climb, you will move directly forward, so you may want to slightly turn to make sure you will move in the right direction before doing so.<ICL>\nIn your first response, describe a multi-step plan using the available actions specified above for completing the task and give reasons that plan might fail. At each subsequent step, the beginning of your response should use the state of the robot, including its current position and orientation, to reason through what progress the robot has made with the plan. You should reconsider your multi-step plan of actions to take, keeping in mind the history of what actions you have selected and the progress in the scene. If the plan seems to be working, keep following actions from that plan. If an action from the plan does not seem to be working, either revise the plan or try a making a new multi-step plan with different actions. For example, if you have had many tries of Climbing over an obstacle and the robot is unable to make reliable forward progress, you might want to try going Backward or Crawling or going Left or Right around the obstacle.\nEach time you give a response, the third to last word of your response should be a yes or no indicating whether progress was made on the prior state with the previous command. The second to last word of your output should be the action to take. The last word of your response should be a magnitude (Small, Medium, Large) that specifies how much of that action to take. For Right or Left commands, magnitude Small corresponds to turning that direction a full camera view amount. For other commands, magnitude Small corresponds to taking that action for around one second. Once again, the last three words of your response must be in the format yes/no Walk/Crawl/Left/Right/Backward/Climb Small/Medium/Large.",
      "successive_text": "Based on your last action, the robot has moved. Here is what the robot currently sees. If the view is exactly the same as before, this is likely because your last action was not appropriate for this situation and the body of the robot is probably stuck (maybe because of an unobserved obstacle). Keep in mind that this is the view from the head of the robot. Even if the camera view is clear, the body of the robot might be stuck. In these cases, consider Backward. Remember your ultimate objective of making progress in the direction the robot initially started in so that you eventually arrive at the red chew toy. Use the state of the robot including its current position and orientation to reason through what progress the robot has made with the plan. You should reconsider your multi-step plan of actions to take, keeping in mind the history of what actions you have selected and the progress in the scene. If the plan is working well, keep following actions from that plan, making slight adjustments if necessary. If the plan is not working, try a new multi-step plan with different actions. For example, if you had many tries of Climbing over an obstacle and the robot is unable to make reliable forward progress, you might want to try going Backward or Crawling or going Left or Right around the obstacle. End your response with the first action in the chosen plan and a magnitude in the format specified earlier.",
      "icl": "configs/icl/"
    }
}